<p>Class:  USC Viterbi Data Analytics Bootcamp</p>
<p>Team:  Analyticus (aka Team 5)</p>
<p>Module:  pull_flu_data.py<p>
<p>Input:  CDC Influenza-Like-Illness CSV File:  cdc_national.csv</p>
<p>Output:  cdc_national.json
<p>Description:
<ul>
<li>Load pandas.DataFrame from cdc_national.csv file.</li>
<li>Format json string by looping through the DataFrame</li>
<li>Write json string to cdc_national.json</li>
</ul>

In [1]:
# Import dependances.
import json
import csv
import pandas as pd

In [20]:
# Load pandas.Dataframe from cdc.csv.
df = pd.read_csv('data/cdc_national_10_years.csv', skiprows=[0])

In [21]:
df.head()

,REGION TYPE,REGION,YEAR,WEEK,% WEIGHTED ILI,%UNWEIGHTED ILI,AGE 0-4,AGE 25-49,AGE 25-64,AGE 5-24,AGE 50-64,AGE 65,ILITOTAL,NUM. OF PROVIDERS,TOTAL PATIENTS
0,National,X,2008,40,1.068280,1.02284,1535,X,1476,2352,X,324,5687,1435,555999
1,National,X,2008,41,1.007560,1.03017,1861,X,1485,2291,X,322,5959,1500,578446
2,National,X,2008,42,0.979399,1.01245,1869,X,1467,2219,X,341,5896,1525,582351
3,National,X,2008,43,1.049430,1.08359,1976,X,1668,2474,X,367,6485,1527,598473
4,National,X,2008,44,1.132180,1.16578,2119,X,1869,2547,X,452,6987,1545,599343

In [22]:
df2 = df[['YEAR', 'WEEK', 'ILITOTAL']]

In [23]:
# Inspect dataframe
df2.head()

   YEAR  WEEK  ILITOTAL
0  2008    40      5687
1  2008    41      5959
2  2008    42      5896
3  2008    43      6485
4  2008    44      6987

In [35]:
df2.columns

Index(['YEAR', 'WEEK', 'ILITOTAL'], dtype='object')

In [52]:
df3 = pd.DataFrame()
for df2_index in df2.index:
    if df2.loc[df2_index, 'WEEK'] > 39:
        df3.loc[df2_index, 'YEAR'] = df2.loc[df2_index, 'YEAR']
        df3.loc[df2_index, 'WEEK'] = df2.loc[df2_index, 'WEEK'] - 39
    else:
        df3.loc[df2_index, 'WEEK'] = df2.loc[df2_index, 'WEEK'] + 13
        df3.loc[df2_index, 'YEAR'] = df2.loc[df2_index, 'YEAR'] - 1
    df3.loc[df2_index, 'ILITOTAL'] = df2.loc[df2_index, 'ILITOTAL']

In [54]:
df3.head()

     YEAR  WEEK  ILITOTAL
0  2008.0   1.0    5687.0
1  2008.0   2.0    5959.0
2  2008.0   3.0    5896.0
3  2008.0   4.0    6485.0
4  2008.0   5.0    6987.0

In [56]:
df4 = df3.sort_values(['YEAR', 'WEEK'])

In [57]:
df4.head()

     YEAR  WEEK  ILITOTAL
0  2008.0   1.0    5687.0
1  2008.0   2.0    5959.0
2  2008.0   3.0    5896.0
3  2008.0   4.0    6485.0
4  2008.0   5.0    6987.0

In [59]:
df5 = df4.loc[:,['YEAR', 'WEEK','ILITOTAL']].astype(int)

In [91]:
df5.head()

   YEAR  WEEK  ILITOTAL
0  2008     1      5687
1  2008     2      5959
2  2008     3      5896
3  2008     4      6485
4  2008     5      6987

In [82]:
df6 = pd.DataFrame(df5.groupby('YEAR').agg({'ILITOTAL': 'sum'}))

In [92]:
df6.head()

      ILITOTAL
YEAR
2008    646101
2009    824107
2010    644978
2011    515225
2012    728957

In [90]:
df6.columns
df6.loc[2011, 'ILITOTAL']

515225

In [103]:
for df5_index in df5.index:
    df6_index = df5.loc[df5_index, 'YEAR']
    df5.loc[df5_index, 'FLU_PERCENT'] = (df5.loc[df5_index, 'ILITOTAL'] / df6.loc[df6_index, 'ILITOTAL']) * 100

In [107]:
pd.DataFrame(df5.groupby('YEAR').agg({'FLU_PERCENT': 'sum'}))

      FLU_PERCENT
YEAR
2008        100.0
2009        100.0
2010        100.0
2011        100.0
2012        100.0
2013        100.0
2014        100.0
2015        100.0
2016        100.0
2017        100.0

In [108]:
# Write string to cdc.json
df5.to_json('data/cdc_national_10_years.json')

In [109]:
df7 = pd.read_json('data/cdc_national_10_years.json')

In [111]:
df8 = df7.sort_values(by=['YEAR', 'WEEK'])

In [113]:
df8

     FLU_PERCENT  ILITOTAL  WEEK  YEAR
0       0.880203      5687     1  2008
1       0.922302      5959     2  2008
2       0.912551      5896     3  2008
3       1.003713      6485     4  2008
4       1.081410      6987     5  2008
5       1.129390      7297     6  2008
6       1.186657      7667     7  2008
7       1.196872      7733     8  2008
8       1.181549      7634     9  2008
9       1.347777      8708    10  2008
10      1.344836      8689    11  2008
11      1.209099      7812    12  2008
12      1.347467      8706    13  2008
13      1.331526      8603    14  2008
14      1.386161      8956    14  2008
15      1.437701      9289    15  2008
16      1.773097     11456    16  2008
17      2.216991     14324    17  2008
18      2.827422     18268    18  2008
19      3.353500     21667    19  2008
20      3.098896     20022    20  2008
21      3.165140     20450    21  2008
22      2.854198     18441    22  2008
23      2.431663     15711    23  2008
24      2.054942     13277    24  2008
25      1.764430     11400    25  2008
26      1.496515      9669    26  2008
27      1.309393      8460    27  2008
28      1.117782      7222    28  2008
29      1.137283      7348    29  2008
..           ...       ...   ...   ...
465     0.866989      7133    48  2016
466     0.859697      7073    49  2016
467     1.010900      8317    50  2016
468     1.041165      8566    51  2016
469     1.103519      9079    52  2016
470     1.364682     13021     1  2017
471     1.393084     13292     2  2017
472     1.504703     14357     3  2017
473     1.660654     15845     4  2017
474     1.790195     17081     5  2017
475     1.988488     18973     6  2017
476     2.283203     21785     7  2017
477     2.066359     19716     8  2017
478     2.489776     23756     9  2017
479     2.600452     24812    10  2017
480     3.296574     31454    11  2017
481     4.458037     42536    12  2017
482     4.712611     44965    13  2017
483     4.946748     47199    14  2017
484     5.936119     56639    15  2017
485     6.595350     62929    16  2017
486     8.072069     77019    17  2017
487     8.921942     85128    18  2017
488     9.118978     87008    19  2017
489     7.897043     75349    20  2017
490     5.486395     52348    21  2017
491     3.676497     35079    22  2017
492     2.957736     28221    23  2017
493     2.541655     24251    24  2017
494     2.240652     21379    25  2017

[495 rows x 4 columns]